wsdl/WSI_PaymentRefDetailsQuery.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<wsdl:definitions
     name="WSI_PaymentRefDetailsQuery"
     targetNamespace="http://www.bancoeconomico.ao/soa/paymentrefdetails"
     xmlns:tns="http://www.bancoeconomico.ao/soa/paymentrefdetails"
     xmlns:inp1="http://www.bancoeconomico.ao/xsd/paymentrefdetails"
     xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
     xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    >
    <wsdl:documentation>
        <abstractWSDL>http://spf-webservices-uat.bancoeconomico.ao:7443/soa-infra/services/SPF/WSI_PaymentRefDetailsQuery!1.0/WSDLs/WSI_PaymentRefDetailsQuery.wsdl</abstractWSDL>
    </wsdl:documentation>
<wsp:Policy xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="third_party_auth_policy">
   <sp:SupportingTokens xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
      <wsp:Policy>
         <sp:UsernameToken sp:IncludeToken="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy/IncludeToken/AlwaysToRecipient">
            <wsp:Policy>
               <sp:WssUsernameToken10/>
            </wsp:Policy>
         </sp:UsernameToken>
      </wsp:Policy>
   </sp:SupportingTokens>
</wsp:Policy>    <wsdl:types>
    </wsdl:types>
    <wsdl:message name="paymentRefDetailsQueryRequestMessage">
        <wsdl:part name="paymentRefDetailsQueryRequest" element="inp1:PaymentRefDetailsQueryRequest"/>
    </wsdl:message>
    <wsdl:message name="paymentRefDetailsQueryResponseMessage">
        <wsdl:part name="paymentRefDetailsQueryResponse" element="inp1:PaymentRefDetailsQueryResponse"/>
    </wsdl:message>
    <wsdl:portType name="paymentRefDetailsQuery_ptt">
        <wsdl:operation name="paymentRefDetailsQuery_execute">
            <wsdl:input message="tns:paymentRefDetailsQueryRequestMessage"/>
            <wsdl:output message="tns:paymentRefDetailsQueryResponseMessage"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="paymentRefDetailsQuery_pttBinding" type="tns:paymentRefDetailsQuery_ptt">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
      <wsp:PolicyReference xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" URI="#third_party_auth_policy" wsdl:required="false"/>
        <wsdl:operation name="paymentRefDetailsQuery_execute">
            <soap:operation style="document" soapAction="paymentRefDetailsQuery_execute"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="WSI_PaymentRefDetailsQuery">
        <wsdl:port name="paymentRefDetailsQuery_pt" binding="tns:paymentRefDetailsQuery_pttBinding">
            <soap:address location="http://spf-webservices-uat.bancoeconomico.ao:7443/soa-infra/services/SPF/WSI_PaymentRefDetailsQuery/WSI_PaymentRefDetailsQuery"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
